 [
  {
  "xCoord":"40.720883",
  "yCoord":"-74.315715",
  "cam":{
  "xCoord":"40.721995",
  "yCoord":"-74.316518",
  "altitude":"500",
  "pitch":"10"
  },
  "DetailText":"My first line of code was written in Computer Science 1 during my freshman year at Millburn High School. I fell in love with coding. I started coding in my free time, learning what I know today. I continued with CS courses throughout high school and taught myself iOS development. In 10th grade, I published my first app as part of an English final. \n\n\n",
  "DetailTitle":"Millburn High School",
  "DetailSubtitle":"Millburn, NJ 2012",
  "DetailImage":"Millburn-high"
  },
  {
  "xCoord":"40.754737",
  "yCoord":"-73.992218",
  "cam":{
  "xCoord":"40.754805",
  "yCoord":"-73.990352",
  "altitude":"120",
  "pitch":"60"
  },
  "DetailText":"One of the ways I gained experience developing iOS apps was through an internship with U.S. Squash, the national governing non-profit company that organizes squash throughout the United States. In the summer of 2014, I joined their tech department as a mobile developer. I was given a project to build an iPad app to view their website. By the end of the summer I finished the app. I didn’t become an active developer until after my first hackathon. Hackathons and app development quickly became a defining part of who I am.\n\n\n",
  "DetailTitle":"U.S. Squash Headquarters",
  "DetailSubtitle":"Summer 2014",
  "DetailImage":"USSquashLogo"
  },
  {
  "xCoord":"39.951752",
  "yCoord":"-75.190952",
  "cam":{
  "xCoord":"39.9465113",
  "yCoord":"-75.1939131",
  "altitude":"400",
  "pitch":"55"
  },
  "DetailText":"My first hackathon was Penn Apps XI, a 1300+ person hackathon held by UPenn. I signed up without any knowledge of what a hackathon was and attended the event without a team. At the event, I met three other great iOS devs. We collaborated in creating an app called MagicPen. It uses CLLocationManager's raw compass data to detect a nearby magnet and derives its position, allowing the magnet to be used as a stylus. It was the coolest project I had built to date and it inspired me to improve as an iOS dev and to work on my own projects.\n\n\n",
  "DetailTitle":"Penn Apps XI",
  "DetailSubtitle":"January 2015",
  "DetailImage":"IsometricAtPennAppsXI"
  },
  {
  "xCoord":"40.705496",
  "yCoord":"-74.014050",
  "cam":{
  "xCoord":"40.703431",
  "yCoord":"-74.015313",
  "altitude":"300",
  "pitch":"55"
  },
  "DetailText":"I loved PennApps so much that I went to CodeDay NYC less than a month later. My team developed a music visualizer app named ViewZik (see My Apps). At the end of 24 hours, I was exhausted, but we had a fully functioning music visualizer to present to the judges. We won the Best Application Prize, which elated me because I could see my growth as a developer and that my work had paid off.\n\n\n",
  "DetailTitle":"CodeDay NYC",
  "DetailSubtitle":"February 2015",
  "DetailImage":"IsometricAtCodeDay"
  },
  {
  "xCoord":"40.902247",
  "yCoord":"-74.034369",
  "cam":{
  "xCoord":"40.901054",
  "yCoord":"-74.037800",
  "altitude":"200",
  "pitch":"55"
  },
  "DetailText":"Two weeks later I was at another hackathon, HackBCA II, the nation's largest high school hackathon with over 500 participants. My team made Smith (see My Apps), an app that triggers actions through set vibration patterns. We placed second overall at HackBCA. This was the second hackathon in a row that I had won a prize at. I could not wait to compete at more hackathons!\n\n\n",
  "DetailTitle":"Hack BCA II",
  "DetailSubtitle":"March 2015",
  "DetailImage":"IsometricHackBCAStage"
  },
  {
  "xCoord":"40.729868",
  "yCoord":"-73.990332",
  "cam":{
  "xCoord":"40.7253786",
  "yCoord":"-73.992471",
  "altitude":"300",
  "pitch":"55"
  },
  "DetailText":"After HackBCA, the hackathon season was ending. I searched for other events and found the annual \"Dream it. Code it. Win it.\" Competition. The competition is hosted by the MIT Club of NYC and aims to use technology to solve problems. My team came up with Snappr (see My Apps), an app that organizes photos based on a schedule. Throughout March we developed and submitted it. We were chosen as one of the \"Winners\".\n\n\n",
  "DetailTitle":"Dream, Code, Win",
  "DetailSubtitle":"April 2015",
  "DetailImage":"IsometricHackBCAStage"
  },
  {
  "xCoord":"40.736832",
  "yCoord":"-74.330647",
  "cam":{
  "xCoord":"38.991636",
  "yCoord":"-74.317981",
  "altitude":"800000",
  "pitch":"10"
  },
  "DetailText":"After the hackathon season I went into freelancing and created Isometric Studios with some partners. We started looking for jobs and built our website. I learned web development from helping build isometricapps.com and building my personal website averylamp.me. Throughout 2015, I worked on freelance jobs either with the Isometric team or alone. My favorite job was done on my own, Dribble Up. I built an iOS basketball tracking and analytics app with provided algorithms, learning computer vision in the process (http://dribbleup.com/).\n\n\n",
  "DetailTitle":"Isometric Studios",
  "DetailSubtitle":"isometricapps.com",
  "DetailImage":"DribbleUpPromoPic"
  },
  {
  "xCoord":"40.754737",
  "yCoord":"-73.992218",
  "cam":{
  "xCoord":"40.754805",
  "yCoord":"-73.990352",
  "altitude":"120",
  "pitch":"60"
  },
  "DetailText":"During the summer of 2015 I interned again at U.S. Squash. This time, I had enough experience to confidently tackle a large project. For the six weeks of my internship, I built a squash match scoring app for referees to use. At the time, U.S. Squash was updating their website with live scoring capabilities; my scoring app enabled referees to update the scores live. The app was published and now it is used in every higher level sanctioned tournaments, which was rewarding for me to see.\n\n\n",
  "DetailTitle":"U.S. Squash Headquarters",
  "DetailSubtitle":"Summer 2015",
  "DetailImage":"USSquashScoringMain"
  },
  {
  "xCoord":"39.901183",
  "yCoord":"-75.171975",
  "cam":{
  "xCoord":"39.897289",
  "yCoord":"-75.168142",
  "altitude":"100",
  "pitch":"75"
  },
  "flyoverAltitude":"100000",
  "DetailText":"In the fall of 2015 the hackathon season returned. PennApps XIII was larger than ever with 2,000 participants, the largest student hackathon in the world. I teamed up with students from Europe and Calilfornia. We built PocketLab (see My Apps), a proof of concept app that uses computer vision (which I learned while freelancing) to diagnose and analyze blood samples. We won the Hottest Health Hack prize, a huge achievement! In under eight months, I went from my first hackathon to winning a prize at the largest student hackathon ever! (The CA student, soon got a full time job at Apple!)\n\n\n",
  "DetailTitle":"PennApps XII",
  "DetailSubtitle":"September 2015",
  "DetailImage":"PennAppsXII"
  },
  {
  "xCoord":"40.720737",
  "yCoord":"-74.316513",
  "cam":{
  "xCoord":"40.721995",
  "yCoord":"-74.316518",
  "altitude":"500",
  "pitch":"10"
  },
  "DetailText":"A group of friends and I planned to bring a hackathon to Millburn. It was a huge task for a group of students, but Millburn's first hackathon, HackMHS turned out to be a spectacular success. On October 12, we ran HackMHS for 12 hours. We had over 100 hackers and plenty of food for everyone. We designed many workshops for the beginners that attended, including an iOS workshop which I taught. The response from the community was so favorable that we started planning HackMHS II in the spring.\n\n\n",
  "DetailTitle":"HackMHS I",
  "DetailSubtitle":"October 2015",
  "DetailImage":"HackMHSPizza"
  },
  {
  "xCoord":"42.359745",
  "yCoord":"-71.092057",
  "cam":{
  "xCoord":"42.355182",
  "yCoord":"-71.089168",
  "altitude":"180",
  "pitch":"75"
  },
  "flyoverAltitude":"100000",
  "DetailText":"After HackMHS I, I took a break from hackathons to do college applications. I was accepted to MIT early action. I am incredibly excited about the computer science opportunities available at MIT and I expect to major in Computer Science.\n\n",
  "DetailTitle":"MIT",
  "DetailSubtitle":"Class of 2020",
  "DetailImage":"MITPicture"
  },
  {
  "xCoord":"37.427619",
  "yCoord":"-122.170213",
  "cam":{
  "xCoord":"37.432113",
  "yCoord":"-122.168642",
  "altitude":"80",
  "pitch":"75"
  },
  "flyoverAltitude":"10000000",
  "DetailText":"I returned to hackathons after I was accepted into MIT. I was one of the few high school students invited to TreeHacks, Stanford's annual hackathon. I teamed up with a friend from PennApps XII plus two others, and we built an app that builds apps with a combination of React-Native and Swift. It allows users to drag, drop, and edit properties of native UI elements as well as set up simple actions. We won the Facebook's Favorite Choice prize, and they sent me an Oculus. After the event I stayed in CA for a few days to visit my friend working at his new job at Apple.\n\n\n",
  "DetailTitle":"TreeHacks",
  "DetailSubtitle":"February 2016",
  "DetailImage":"AveryAtApple"
  },
  {
  "xCoord":"40.902101",
  "yCoord":"-74.033875",
  "cam":{
  "xCoord":"40.901054",
  "yCoord":"-74.037800",
  "altitude":"200",
  "pitch":"55"
  },
  "DetailText":"Most recently, I went to HackBCA III with my younger brother. I helped him during the hackathon since he had just started to learn iOS development. The Isometric team and I built Reppin (see My Apps), a computer vision rep counter. We placed Third overall and won the Best Mobile App prize, while my brother experienced his first hackathon. I hope to continue helping my brother grow as an iOS developer so he can follow in my footsteps and learn to love to create like I do.\n\n\n",
  "DetailTitle":"Hack BCA III",
  "DetailSubtitle":"April 2016",
  "DetailImage":"IsometricAtHackBCAIII"
  },
  {
  "xCoord":"37.778020",
  "yCoord":"-122.417330",
  "cam":{
  "xCoord":"37.780559",
  "yCoord":"-122.417846",
  "altitude":"80",
  "pitch":"75"
  },
  "flyoverAltitude":"10000000",
  "DetailText":"Hopefully the next step in my journey includes being invited to the WWDC 2016. I am extremely excited to hear about the new tech releases and updates and to meet the many interesting people who will be attending. \n\n\n",
  "DetailTitle":"WWDC 2016",
  "DetailSubtitle":"June 2016",
  "DetailImage":"WWDC16WallpaperTall"
  },
  ]